# Pandas DataFrame 

- 라벨이 있는 2차원의 데이터를 처리하는 라이브러리
- 엑셀이 하는 일과 비슷한 일을 파이썬으로 할 수 있다.
- NumPy 기반으로 매우 빠르다.
- 다양하게 데이터를 가공하고 처리할 수 있다.
- 자동화, 빅데이터 처리, 머신 러닝, 딥 러닝 등을 위해서 필수적으로 배워야 하는 도구

## DataFrame

- 가장 큰 데이터 묶음
- 파일로부터 생성 가능
- 또는 기존의 데이터에서 변환 가능

## Series
- 리스트와 유사한 자료구조
- 리스트와 달리 라벨이 붙어 있다.

## 시작하기

In [1]:
import pandas as pd

In [2]:
!ls ./data

data-header.csv  mongo.xls  no-header.csv  panda_file.csv  seoul-data.csv

In [3]:
!cat ./data/data-header.csv

name,age,money,sex
둘리,100,100,M
길동,40,500000,M
또치,15,50,F
희동,3,,M

## 파이썬에서 파일 읽기
1. open() # 열고
2. read() # 읽고
3. close() #닫는다.

In [5]:
fp = open('./data/data-header.csv')

In [6]:
data = fp.read()
data

'name,age,money,sex\n둘리,100,100,M\n길동,40,500000,M\n또치,15,50,F\n희동,3,,M'

In [7]:
fp.close()

In [9]:
type(data)

str

In [10]:
dooly_data = data.split('\n')
dooly_data

['name,age,money,sex',
 '둘리,100,100,M',
 '길동,40,500000,M',
 '또치,15,50,F',
 '희동,3,,M']

In [11]:
header = dooly_data[0].split(',')
header

['name', 'age', 'money', 'sex']

In [12]:
dooly_data = dooly_data[1:]
dooly_data

['둘리,100,100,M', '길동,40,500000,M', '또치,15,50,F', '희동,3,,M']

In [24]:
def genDict(item):
    sitem = item.split(',')
    item_dict = {}
    for i in range(len(header)):
        item_dict[header[i]] = sitem[i] 
    return item_dict

dooly2 = dooly[1:]
dooly2
dooly_data = [genDict(i) for i in dooly2]
dooly_data

[{'age': '100', 'money': '100', 'name': '둘리', 'sex': 'M'},
 {'age': '40', 'money': '500000', 'name': '길동', 'sex': 'M'},
 {'age': '15', 'money': '50', 'name': '또치', 'sex': 'F'},
 {'age': '3', 'money': '', 'name': '희동', 'sex': 'M'}]

In [ ]:
dooly_data = [i.split(',') for i in dooly_data]

In [41]:
print(header)
print(dooly_data[0])
dict(zip(header, dooly_data[0]))

['name', 'age', 'money', 'sex']
['둘리', '100', '100', 'M']

{'age': '100', 'money': '100', 'name': '둘리', 'sex': 'M'}

In [46]:
result = [dict(zip(header,item)) for item in dooly_data]
result

[{'age': '100', 'money': '100', 'name': '둘리', 'sex': 'M'},
 {'age': '40', 'money': '500000', 'name': '길동', 'sex': 'M'},
 {'age': '15', 'money': '50', 'name': '또치', 'sex': 'F'},
 {'age': '3', 'money': '', 'name': '희동', 'sex': 'M'}]

In [47]:
pd.DataFrame(result)

   age   money name sex
0  100     100   둘리   M
1   40  500000   길동   M
2   15      50   또치   F
3    3           희동   M

In [48]:
import pandas as pd

In [49]:
!ls ./data

data-header.csv  mongo.xls  no-header.csv  panda_file.csv  seoul-data.csv

In [52]:
df = pd.read_csv('./data/data-header.csv')
df

  name  age     money sex
0   둘리  100     100.0   M
1   길동   40  500000.0   M
2   또치   15      50.0   F
3   희동    3       NaN   M

In [53]:
df = pd.read_csv('./data/seoul-data.csv')

In [54]:
len(df)

11915

## describe, info

In [56]:
df.head()

,NO,M-N0,M-NAME,P-NO,P-NAME,SIZE,PRICE,YEAR,ETC,CHECK-DATE,MTYPE-NO,MART-TYPE,A-CODE,A-NAME
0,1222813,60,이마트 청계점,305,"사과(부사, 300g)",1개,1750,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
1,1222814,60,이마트 청계점,284,배(중품),1개,2200,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
2,1222815,60,이마트 청계점,271,배추(중간),1포기 2.5kg,3980,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
3,1222816,60,이마트 청계점,133,무(세척무),1개,2280,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
4,1222817,60,이마트 청계점,309,양파(1.5kg망),1망,2780,2018-04,NaN,2018-04-19,2,대형마트,140000,중구

In [55]:
df.describe()

,NO,M-N0,P-NO,PRICE,MTYPE-NO,A-CODE
count,1.191500e+04,11915.000000,11915.000000,11915.000000,11915.000000,11915.000000
mean,1.187936e+06,101.450608,220.864876,5316.608057,1.509190,417407.469576
std,2.691104e+04,66.597966,104.907023,7052.859565,0.499937,185353.610108
min,1.144006e+06,1.000000,13.000000,0.000000,1.000000,110000.000000
25%,1.161604e+06,45.000000,144.000000,1845.000000,1.000000,260000.000000
50%,1.189845e+06,94.000000,266.000000,3000.000000,2.000000,410000.000000
75%,1.216282e+06,145.000000,308.000000,5000.000000,2.000000,560000.000000
max,1.226161e+06,223.000000,320.000000,53400.000000,2.000000,740000.000000

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11915 entries, 0 to 11914
Data columns (total 14 columns):
NO            11915 non-null int64
M-N0          11915 non-null int64
M-NAME        11915 non-null object
P-NO          11915 non-null int64
P-NAME        11915 non-null object
SIZE          11915 non-null object
PRICE         11915 non-null int64
YEAR          11915 non-null object
ETC           9438 non-null object
CHECK-DATE    11915 non-null object
MTYPE-NO      11915 non-null int64
MART-TYPE     11915 non-null object
A-CODE        11915 non-null int64
A-NAME        11915 non-null object
dtypes: int64(6), object(8)
memory usage: 1.3+ MB

## head, tail

In [58]:
df.head(5)

,NO,M-N0,M-NAME,P-NO,P-NAME,SIZE,PRICE,YEAR,ETC,CHECK-DATE,MTYPE-NO,MART-TYPE,A-CODE,A-NAME
0,1222813,60,이마트 청계점,305,"사과(부사, 300g)",1개,1750,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
1,1222814,60,이마트 청계점,284,배(중품),1개,2200,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
2,1222815,60,이마트 청계점,271,배추(중간),1포기 2.5kg,3980,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
3,1222816,60,이마트 청계점,133,무(세척무),1개,2280,2018-04,NaN,2018-04-19,2,대형마트,140000,중구
4,1222817,60,이마트 청계점,309,양파(1.5kg망),1망,2780,2018-04,NaN,2018-04-19,2,대형마트,140000,중구

In [59]:
df.tail(5)

,NO,M-N0,M-NAME,P-NO,P-NAME,SIZE,PRICE,YEAR,ETC,CHECK-DATE,MTYPE-NO,MART-TYPE,A-CODE,A-NAME
11910,1147350,16,현대백화점 미아점,320,달걀(30개),30개 (1판),11000,2017-10,텃골1등급특란,2017-10-30,2,대형마트,290000,성북구
11911,1147351,16,현대백화점 미아점,136,"조기(국산,생물)",1마리 (20cm),0,2017-10,입고안됨,2017-10-30,2,대형마트,290000,성북구
11912,1147352,16,현대백화점 미아점,152,"명태(러시아,냉동)",1마리(35cm),0,2017-10,입고안됨,2017-10-30,2,대형마트,290000,성북구
11913,1147353,16,현대백화점 미아점,254,"오징어(생물,국산)",1마리(25cm),6000,2017-10,NaN,2017-10-30,2,대형마트,290000,성북구
11914,1147354,16,현대백화점 미아점,266,"고등어(생물,국산)",1마리(30cm),8000,2017-10,大,2017-10-30,2,대형마트,290000,성북구

## NaN?

In [62]:
df['ETC'].isnull().sum()

2477

## 헤더가 없는 csv 파일 불러오기

In [63]:
!cat ./data/no-header.csv

둘리, 100, 5000
도우너, 10, 100
김희동, 3, 10

In [66]:
df = pd.read_csv('./data/no-header.csv', header=None)
df.columns = ['name', 'age', 'money']
df

  name  age  money
0   둘리  100   5000
1  도우너   10    100
2  김희동    3     10

In [67]:
df = pd.read_csv('./data/no-header.csv',
                 header=None, 
                 names=['name', 'age', 'money'])
df

  name  age  money
0   둘리  100   5000
1  도우너   10    100
2  김희동    3     10

## 인덱스 지정해 보기

In [74]:
dateIndex = pd.date_range('2018-1-1',periods=3, freq='1d')

In [75]:
df.index = dateIndex
df

           name  age  money
2018-01-01   둘리  100   5000
2018-01-02  도우너   10    100
2018-01-03  김희동    3     10

## reset index
reset_index() 를 사용하면, index 값이 일반 컬럼으로 바뀐다.

In [77]:
df.reset_index()

       index name  age  money
0 2018-01-01   둘리  100   5000
1 2018-01-02  도우너   10    100
2 2018-01-03  김희동    3     10

## Series의 조합으로 DataFrame 만들기

In [79]:
s1 = pd.Series(['둘리','길동' ,'희동'], index = ['a','b','c'])
s1

a    둘리
b    길동
c    희동
dtype: object

In [78]:
s2 = pd.Series([10, 20, 30], index = ['c','a','b'])
s2

c    10
a    20
b    30
dtype: int64

In [80]:
df = pd.DataFrame({'name': s1, 'price': s2})
df

  name  price
a   둘리     20
b   길동     30
c   희동     10

## csv로 저장하기
- 조장가능한 매개변수: index, header, na_rep

In [81]:
df = pd.read_csv('./data/no-header.csv',
                 header=None, 
                 names=['name', 'age', 'money'])
df

  name  age  money
0   둘리  100   5000
1  도우너   10    100
2  김희동    3     10

In [82]:
import numpy as np

In [83]:
df.iloc[2,2] = np.NaN
df

  name  age   money
0   둘리  100  5000.0
1  도우너   10   100.0
2  김희동    3     NaN

In [90]:
# df.to_csv('./data/panda_file.csv', index=None, header=None)
df.to_csv('./data/panda_file.csv')

In [85]:
!ls ./data

data-header.csv  mongo.xls  no-header.csv  panda_file.csv  seoul-data.csv

In [91]:
!cat ./data/panda_file.csv

,name,age,money
0,둘리,100,5000.0
1,도우너,10,100.0
2,김희동,3,

In [93]:
#df = pd.read_csv('./data/panda_file.csv', index_col=0)
df = pd.read_csv('./data/panda_file.csv', index_col = 0)
df

  name  age   money
0   둘리  100  5000.0
1  도우너   10   100.0
2  김희동    3     NaN